---
kind: other
id: Methods.T:Autodesk.Revit.DB.GenericForm
source: html/982b030c-a5d3-797d-75c3-b4d9acec8b09.htm
---
# GenericForm Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.